{
  "language": "\nHi there!\nSelect your language👇\n",
  "start": "\nПривет! Это официальный телеграм-бот Waves.Exchange🤖👋\n\nWaves.Exchange - гибридная криптовалютная биржа, на которой можно торговать, отправлять, выпускать и инвестировать в различные цифровые активы. Покупай криптовалюту без комиссии, получай до 20% за стейкинг стейблкоина USDN и обменивай на Bitcoin, Ethereum, ZCash, Monero и другие популярные монеты. Зарабатывай с Waves.Exchange!\n             \nВстречай наш супер-комбо💰🔝👉: кэшбэк 1 USDN за стейкинг от 10 USDN + еженедельный розыгрыш 100 USDN!\n\nДля участия:\n  💳 Купи минимум 10 USDN, оплатив картой: waves.exchange/staking\n  💵 До 18:00 (МСК) 20 апреля сдай в стейкинг минимум 10 USDN, оплаченные картой.\n  ✅ Нажми на кнопку “Участвовать” под этим сообщением.\n\nВ течение нескольких дней после после регистрации ты получишь кэшбэк за 10 и больше USDN, сданных в стейкинг. Кроме этого, целый месяц мы еженедельно разыгрываем 100 USDN🤑. Вперед!🚀🔷\n\nЕсли при регистрации у тебя возникнут вопросы, обращайся за помощью в Telegram-группе Waves.Exchange 📩➡️ https://t.me/wavesexchangeru",
  "aboutBtn": "О бирже",
  "startBtn": "Регистрация",
  "address": "Чтобы получить кэшбэк и участвовать в розыгрыше 100 USDN, введи свой адрес кошелька биржи Waves.Exchange. Адрес кошелька можно найти на сайте https://waves.exchange/ в правом верхнем углу под твоим ником.",
  "invalidAddress": "Адрес не существует или введен некорректно, попробуй еще раз",
  "wait": "Проверка",
  "alreadyInUse": "Вы уже участвуете в этом контесте и зарегестрировались для получения кэшбека и еженедельного розыгрыша 100 USDN.",
  "notEnoughMoney": "Ты не оплатил USDN картой, а это – обязательное условие участия. Убедись, что ты оплатил USDN, немного подожди и попробуй еще раз!",
  "stakeRequired": "На твоем адресе нет USDN, сданных в стейкинг, или сумма меньше 10 USDN. Убедись, что сдал USDN в стейкинг, немного подожди и попробуй еще раз! ",
  "congratulations": "Ты успешно зарегистрирован в кэшбэк-кампании Waves.Exchange и розыгрыше 100 USDN! Ожидай кэшбэк в ближайшее время. Победителей розыгрыша 100 USDN объявляем каждую неделю! Следи за новостями!",
  "alreadyParticipating": "Ты уже зарегистрирован в кэшбэк-кампании. Ближайший розыгрыш 100 USDN – в течение недели!"
}
