const introMsg =
  "Привет!\n" +
  "Добро пожаловать в путеводитель по игре Waves Ducks.\n" +
  "Я расскажу тебе, как зарабатывать токены Waves Ducks EGG, " +
  "вырастить уникальную утку, производить EGG и получать пассивный доход. \n" +
  "*Поехали!*\n\n" +
  "Waves Ducks NFT-игра, в которой игроки разводят, выращивают и коллекционируют уток." +
  "Утки появляются из яиц, а в нашей игре яйцами служит внутриигровая валюта  EGG.\n\n " +
  "Каждая утка имеет перки, свой процент рарности, генотип и свою историю. " +
  "Скрещивая уток можно получать новую, более уникальную утку. " +
  "Твоя утка поможет тебе получить больше внутриигровых яиц: посадив утку на насест - утка будет фармить дополнительные яица! \n\n" +
  "Участвуя в раундах и выполняя разные квесты ты сможешь получить токены и другие плюшки бесплатно. " +
  "Совсем скоро в игру будут добавлены сражения и каждый игрок сможет вырастить утку, " +
  "если будет ежедневно кормить своего питомца и сражаться вместе с ним в битвах! " +
  "Большее количество уток обеспечит больший доход, который, в свою очередь, можно потратить на новых уток. \n\n" +
  "Построй свою утиную ферму!\n";

const startToPlayMsg =
  "Для начала тебе необходимо зарегистрироваться.\n Несколько простых действий и ты будешь уже в игре:\n" +
  "1. На странице входа [тут](https://wavesducks.com/login) нажми кнопку *Sign Up*\n" +
  "2. Введи свой email-адрес.\n" +
  "3. Придумай и подтверди пароль.\n" +
  "4. Нажми Create Account.\n" +
  "5. На следующем экране введи шестизначный код, который пришел на твою почту.\n" +
  "6. Снова введи пароль и нажмите *Log In*.\n\n" +
  "Как зарегистрируешься, пришли, пожалуйста, ссылку на адрес. Его ты сможешь найти в правом верхнем углу в игре";

const checkIfRegistered = "Как успехи, получилось зарегистрироваться? Я жду 😉";

const wrongWalletAddress =
  "Ты прислал неправильный адрес кошелька, скопируй адрес в правом верхнем углу, находясь залогиненным на https://wavesducks.com/";
const correctWalletAddress =
  "Класс! Твой аккаунт зареган и для игры нужна внутриигровая валюта - EGG или яица. " +
  "Яйца можно купить на бирже, купить с карты и получить, участвуя в специальных раундах. " +
  "Выполняя задания и участвуя в раундах ты будешь получать токены EGG, которые потом сможешь обменять на утку! " +
  "Старт каждого раунда ожидай в канале: https://t.me/wavesducksrounds_ru." +
  "Новые задания публикуются несколько раз в неделю, включай нотифай и не пропускай раунды! \n" +
  "А еще для общения об игре создан специальный чат: https://t.me/duckhunters_ru - присоединяйся к обсуждению»\n";

const connectToChatMsg = "Присоединился к чату?";
const yesConnectToChatMsg = "Супер! Узнаешь много интересного!";
const noConnectToChatMsg =
  "Скорее присоединяйся, потом забудешь! https://t.me/duckhunters_ru." +
  "В чате тебе всегда напомнят о раундах, подскажут, как скрещивать уток, продавать их на аукционах и не только";

const getKnownDucksBetterMsg =
  "Давай лучше разберемся, какие утки бывают, и что с ними делать";

const gameArtifacts =
  "*Артефакты игры:*\n\n" +
  "*EGG* - валюта игры, необходимая для получения уток и айтемов\n\n" +
  "*Baby Duck* - из “Утенка” (Baby Duck) уже совсем скоро можно будет получить взрослую утку, если ты не забудешь ежедневно кормить своего питомца и сражаться вместе с ним в битвах!\n\n" +
  "*Базовая утка* - утка, полученная в обмен на EGG \n\n" +
  "*Выведенная утка* - второе поколение утки, полученный при “скрещивании” двух базовых уток\n\n" +
  "*Стерильная утка* – персонаж, который уже был использован для скрещивания уток в качестве одного из родителей, а значит, больше не сможет участвовать в скрещивании. При этом даже стерильная утка может фармить, если посадить её на насест.\n\n" +
  "*Джекпот-утка* - очень рарная утка, в игре сейчас всего 9 штук джекпотов! Она круто фармит даже без насеста!\n\n" +
  "Кстати, любую утку, кроме Baby Duck ты можешь купить или продать на [маркетплейсе](https://wavesducks.com/marketplace)\n\n" +
  "👇🏻 Смотри, появилась кнопка “Как создать аккаунт”, и ты можешь нажать на нее, чтобы попасть в игру\n\n\n" +
  "Думаю, ты уже хочешь спросить, как же получить валюту EGG, чтобы начать выводить уток. " +
  "Классные новости! Я расскажу, как получить EGG бесплатно. Жми на кнопку 😉";

const getEggFree =
  "Каждую неделю мы запускаем конкурсы в социальных сетях. И у тебя есть возможность выиграть токены EGG!\n\n" +
  "МЫ ЖДЕМ ТЕБЯ:\n" +
  "1. Создай аккаунт \n\n" +
  "2. Присоединяйся к каналу в [Telegram](https://t.me/wavesducksrounds_ru)\n\n" +
  "3. Участвуй в конкурсах и зарабатывай яйца\n\n" +
  "Залетай на [канал](https://t.me/wavesducksrounds_ru) и проверь, возможно, сейчас как раз проходит конкурс.";

const checkCompetitionSuggestion =
  "Залетай на [канал](https://t.me/wavesducksrounds_ru) и проверь, возможно, сейчас как раз проходит конкурс.";

const checkCompetitionQuestion = "Ну что, проверил, идет конкурс?";

const yesCompetition =
  "Отлично! Советую в нем поучаствовать, это весело) Обсудить конкурс всегда можно в [чате] (https://t.me/duckhunters_ru)." +
  "А если ты из тех, кто не хочет заморачиваться, то держи инструкцию, как можно купить EGG с карты";

const noCompetition =
  "Не расстраивайся! Следующий конкурс на подходе :) А пока читай, как можно купить EGG с карты";

const buyEggFromCard =
  "Начните свою утиную историю легко и быстро! Купите EGG с банковской карты за 5 минут: \n\n" +
  "1. Создайте аккаунт \n\n" +
  "2. Пройдите по [ссылке](https://waves.exchange/buycrypto/buyEGG) и следуйте инструкциям\n\n" +
  "3. Обменяйте токены EGG на базовых уток и скрещивайте их для получения уникальной утки\n\n" +
  "Покупка EGG доступна только в браузерной версии Waves.Exchange.\n\n" +
  "На мобильных приложениях покупка будет доступна чуть позже.";
const getDuckFromEgg =
  "1. Открой вкладку “Инкубатор”\n\n" +
  "2. Нажми на кнопку “Начать вылупление”. У тебя на счету должно быть достаточно EGG\n\n" +
  "3. Подожди 2 минуты, пока утка появляется\n\n" +
  "4. Твоя новая утка появится в разделе [Моя ферма](https://wavesducks.com/portfolio)\n\n" +
  "\n" +
  "Попробуй прямо сейчас! Я подожду :)";

const didYouGetDuckFromEggsQuestion = "Ну как, получилось? Пришли ссылку в чат";

const didNotGetDuckFromEggsQuestion = "Давай уже начнем вылупление! Жду";

const gotDuckFromEggsQuestion =
  "Класс! Поздравляю с твоей первой уткой. Теперь давай займемся скрещиванием";

const crossDucks =
  "При “скрещивании” двух уток создается персонаж нового поколения, с более высоким показателем редкости." +
  " Любая утка может быть использована для скрещивания только один раз, после чего утки-“родители” становятся “стерильными”.\n\n" +
  "1. Открой вкладку [Скрещивание](https://wavesducks.com/breeding)\n" +
  "2. Выбери двух уток-родителей и нажмите кнопку Скрестить\n" +
  "3. Подожди пару минут и заберите утку в разделе [Моя ферма](https://wavesducks.com/portfolio/)\n\n" +
  "Скрещивание это целая наука, поэтому давай теперь узнаем про генотипы и поколения.\n";

const genotypesAndGenerations =
  "Генотип каждой утки включает в себя восемь букв, черточку и еще две буквы. " +
  "Генотип определяет уникальность утки: чем выше уникальность - тем ценнее утка и тем больше вознаграждений она принесёт за фарминг.\n\n" +
  "Первые 8 букв. Они отвечают за внешний вид утки. На данный момент таких вариаций в игре всего 6:\n\n" +
  "• А - elon\n" +
  "• B - satoshi\n" +
  "• C - doge\n" +
  "• D - bogdanoff\n" +
  "• E - chad\n" +
  "• F - harold\n" +
  "• G - pepe\n" +
  "\n" +
  "То есть, если вы скрещиваете aaaaaaaa и bbbbbbbb то новая утка может рандомно получить набор из этих двух букв. " +
  "К примеру, утка abaababb могла бы получить нос от Илона, брови от Сатоши, голову от Илона и т д. \n\n\n" +
  "Первая буква после черточки. Эта буква отвечает за ранг этой утки. " +
  "Утка, которая только что вылупилась, будет иметь букву G - genesis, самый низший ранг. Далее идет:\n\n" +
  "• H - hero\n" +
  "• I - ideal\n" +
  "• K - knight\n" +
  "• L - lord\n" +
  "• M - magical\n" +
  "• N - natural\n" +
  "\n" +
  "Чем выше ранг, тем уникальнее утка: чтобы получить новый ранг, надо скрестить двух уток рангом ниже. " +
  "Наименее уникальны базовые утки, которые появляются в достаточно большом количестве. " +
  "Утки следующего поколения, созданные в результате скрещивания, имеют уже более высокий показатель редкости. " +
  "Чем выше уникальность тем больше профита от фарминга утки.\n\n" +
  "Вторая буква после черточки. Она отвечает за цвет фона. " +
  "Соответственно R - red, Y - yellow, G - green, B - blue. " +
  "Каждая утка имеет цвет фона. Также цвет есть у насеста. " +
  "Чтобы успешно участвовать а фарминге, нужно посадить утку на насест соответствующего цвета. " +
  "При скрещивании двух уток фон новой будет выпадать абсолютно рандомно.\n";

const buyDuckOnMarketplace =
  "1. Зайди в раздел https://wavesducks.com/marketplace\n\n" +
  "2. Выбери понравившуюся утку\n\n" +
  "3. Купи сейчас эту утку по цене выкупа или предложи ставку\n\n" +
  "4. После покупки утка будет в разделе [Моя ферма](https://wavesducks.com/portfolio/)\n";

const passiveIncome =
  "И последнее! Неплохо было бы сформировать пассивный доход, правда?";

const howFarmingWorks =
  "Зайди в раздел [Моя ферма](https://wavesducks.com/portfolio) \n\n" +
  "1. Купи “насест” по фиксированной цене 1 EGG\n\n" +
  "2. Кликни на насест и выбери утку такого же цвета\n\n" +
  "3. Как только ты посадишь на насест утку, она начнет производить EGG.\n\n" +
  "Счетчик под насестом обновляется каждую минуту, показывая, как растет число твоих EGG&.\n\n" +
  "Функциональность фарминга доступна для всех уток в игре, включая базовые и полученные в результате скрещивания. " +
  "Утки с более высоким показателем редкости производят больше EGG";

const final =
  "Поздравляю! Теперь ты все знаешь и можешь погружаться в игру по полной!\n\n" +
  "Не забудь вступить в [чат](https://t.me/duckhunters_ru) и написать о своих успехах";

export const messages = {
  introMsg: introMsg,
  startToPlayMsg: startToPlayMsg,
  checkIfRegistered: checkIfRegistered,
  wrongWalletAddress: wrongWalletAddress,
  correctWalletAddress: correctWalletAddress,
  connectToChatMsg: connectToChatMsg,
  yesConnectToChatMsg: yesConnectToChatMsg,
  noConnectToChatMsg: noConnectToChatMsg,
  getKnownDucksBetterMsg: getKnownDucksBetterMsg,
  gameArtifacts: gameArtifacts,
  getEggFree: getEggFree,
  checkCompetitionSuggestion: checkCompetitionSuggestion,
  checkCompetitionQuestion: checkCompetitionQuestion,
  yesCompetition: yesCompetition,
  noCompetition: noCompetition,
  buyEggFromCard: buyEggFromCard,
  getDuckFromEgg: getDuckFromEgg,
  didYouGetDuckFromEggsQuestion: didYouGetDuckFromEggsQuestion,
  didNotGetDuckFromEggsQuestion: didNotGetDuckFromEggsQuestion,
  gotDuckFromEggsQuestion: gotDuckFromEggsQuestion,
  crossDucks: crossDucks,
  genotypesAndGenerations: genotypesAndGenerations,
  buyDuckOnMarketplace: buyDuckOnMarketplace,
  howFarmingWorks: howFarmingWorks,
  final: final,
  passiveIncome: passiveIncome,
};

export const enum BUTTONS {
  GO_BACK = "Назад",
  CREATE_ACCOUNT = "Как создать аккаунт",
  START_TO_PLAY = "Как начать играть",
  GAME_ARTIFACTS = "Артефакты игры",
  GET_EGGS_FREE = "Как получить EGG бесплатно",
  BUY_EGGS_CREDIT_CARD = "Kак купить EGG с карты",
  BUY_DUCK_MARKETPLACE = "Как купить утку на маркетплейсе",
  GET_DUCK_FROM_EGG = "Как получить утку из яйца",
  CROSS_DUCKS = "Как скрещивать уток",
  GENOTYPE_GENERATION = "Что такое генотипы и поколения",
  NO = "Нет",
  YES = "Да",
  FARMING_EGG = "Как работает фарминг EGG",
}
